src/cfe/osn/InformationRegisters/_СостоянияОповещенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_СостоянияОповещенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочтена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пометка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещениеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдаленаИзСпискаНовостей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвтоСбросНапоминанияПриПрочтении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСбросаВажности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подзаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНовости</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказыПоставщикам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cfe/osn/InformationRegisters/СостоянияЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовПоставщикам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаказовПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПоступления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕстьРасхожденияОрдерНакладная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/InformationRegisters/ДанныеБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДанныеБизнесПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Стартован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.БизнесПроцесс</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/InformationRegisters/ТоварыКДоставке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыКДоставке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсеТовары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПолучательОтправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаДоставку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/Enums/СостоянияЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаетсяСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаетсяОбеспечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГотовКОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГотовКОтгрузке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/CommonModules/_РаботаСИнтерфейсомСервер/Ext/Module.bsl
#Область СистемаНапоминанийПользователя

Процедура СистемаНапоминанийПриСозданииНаСервере( ИмяОсновнойГруппыСтраниц , Форма ) Экспорт
	
	ИспользоватьНапоминания = ПолучитьФункциональнуюОпцию("ИспользоватьНапоминанияПользователя");
	
	Если НЕ ( ИспользоватьНапоминания ) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСпискаНапоминаний = "СписокНапоминаний";
	ТаблицаСписка        = "РегистрСведений.НапоминанияПользователя";
	
	
	СтраницаСписокНапоминаний = Форма.Элементы.Добавить( "СтраницаСписокНапоминаний", Тип("ГруппаФормы"), Форма.Элементы[ ИмяОсновнойГруппыСтраниц ]);
	СтраницаСписокНапоминаний.Вид = ВидГруппыФормы.Страница;
	СтраницаСписокНапоминаний.Заголовок = "Мои напоминания";
	
	ГруппаШапка = Форма.Элементы.Добавить(	"ГруппаШапка",Тип("ГруппаФормы"),СтраницаСписокНапоминаний);
	ГруппаШапка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаШапка.Отображение 				= ОтображениеОбычнойГруппы.Нет;
	ГруппаШапка.ОтображатьЗаголовок 		= Ложь; 
	ГруппаШапка.Группировка 				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаШапка.РастягиватьПоГоризонтали 	= Истина;
	
	//КоманднаяПанельСписка  = Форма.Элементы.Добавить(ИмяСпискаНапоминаний + "КоманднаяПанель2",Тип("ГруппаФормы"),ГруппаШапка);
	//КоманднаяПанельСписка.Вид = ВидГруппыФормы.КоманднаяПанель;
	
	
	ГруппаПодвал = Форма.Элементы.Добавить(	"ГруппаПодвал",Тип("ГруппаФормы"),СтраницаСписокНапоминаний);
	ГруппаПодвал.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПодвал.Отображение 				= ОтображениеОбычнойГруппы.Нет;
	ГруппаПодвал.ОтображатьЗаголовок 		= Ложь; 
	ГруппаПодвал.Группировка 				= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПодвал.РастягиватьПоГоризонтали 	= Истина;

	
	//Динамический список
	
	ТипыРеквизита = Новый Массив;                             
	ТипыРеквизита.Добавить(Тип("ДинамическийСписок"));
	
	ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита); 
	ДинамическийСписок = Новый РеквизитФормы(ИмяСпискаНапоминаний, ОписаниеТиповДляРеквизита,,"",ЛОЖЬ); 
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);        
	РеквизитДинамическийСписок = Форма[ИмяСпискаНапоминаний]; 
	
	РеквизитДинамическийСписок.ПроизвольныйЗапрос = ИСТИНА;
	РеквизитДинамическийСписок.ТекстЗапроса = "ВЫБРАТЬ
												|	РегистрСведенийНапоминанияПользователя.Пользователь КАК Пользователь,
												|	РегистрСведенийНапоминанияПользователя.ВремяСобытия КАК ВремяСобытия,
												|	РегистрСведенийНапоминанияПользователя.Источник КАК Источник,
												|	РегистрСведенийНапоминанияПользователя.СрокНапоминания КАК СрокНапоминания,
												|	РегистрСведенийНапоминанияПользователя.Описание КАК Описание,
												|	РегистрСведенийНапоминанияПользователя.СпособУстановкиВремениНапоминания КАК СпособУстановкиВремениНапоминания,
												|	РегистрСведенийНапоминанияПользователя.ИнтервалВремениНапоминания КАК ИнтервалВремениНапоминания,
												|	РегистрСведенийНапоминанияПользователя.ИмяРеквизитаИсточника КАК ИмяРеквизитаИсточника,
												|	РегистрСведенийНапоминанияПользователя.Расписание КАК Расписание,
												|	РегистрСведенийНапоминанияПользователя.ПредставлениеИсточника КАК ПредставлениеИсточника
												|ИЗ
												|	РегистрСведений.НапоминанияПользователя КАК РегистрСведенийНапоминанияПользователя
												|ГДЕ
												|	РегистрСведенийНапоминанияПользователя.Пользователь = &Пользователь";
	Если НЕ ПустаяСтрока(ТаблицаСписка) Тогда 
		РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка; 
	КонецЕсли;
	
	ТаблицаФормы = Форма.Элементы.Добавить(ИмяСпискаНапоминаний,Тип("ТаблицаФормы"), ГруппаПодвал );
	ТаблицаФормы.ПутьКДанным = ИмяСпискаНапоминаний;
	Форма.Элементы[ИмяСпискаНапоминаний].ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	СтКолонки = "СрокНапоминания,Описание,ВремяСобытия,Источник,Пользователь";
	МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтКолонки,",");
	
	Для Каждого Элемент Из МассивКолонок Цикл
		НоваяКолонкаТаблицы = Форма.Элементы.Добавить(ИмяСпискаНапоминаний + Элемент, Тип("ПолеФормы"), ТаблицаФормы);
		НоваяКолонкаТаблицы.Заголовок = Элемент; 
		НоваяКолонкаТаблицы.ПутьКДанным = ИмяСпискаНапоминаний + "." + Элемент; 	
		Если ( Элемент = "Пользователь" ) Тогда
			НоваяКолонкаТаблицы.Видимость = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
	РеквизитДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());
	
	
	//Кнопки-Команды
	
	ДобавитьКнопкуНаФорму( Форма, "СоздатьНапоминание", "Создать", "ПодключаемыйСоздатьНапоминание", ГруппаШапка );
	ДобавитьКнопкуНаФорму( Форма, "ИзменитьНапоминание", "Изменить", "ПодключаемыйИзменитьНапоминание", ГруппаШапка );
	ДобавитьКнопкуНаФорму( Форма, "УдалитьНапоминание", "Удалить", "ПодключаемыйУдалитьНапоминание", ГруппаШапка );
	
	
	
КонецПроцедуры	

Процедура ДобавитьКнопкуНаФорму( Форма, ИмяКоманды, Заголовок, ИмяДействия, Группа )
	
	//Добавление команды формы
	Команда = Форма.Команды.Добавить(ИмяКоманды );
	Команда.Заголовок = Заголовок;
	Команда.Действие  = ИмяДействия; //Имя связанной процедуры
	
	
	//Добавление кнопки формы
	КнопкаФормы = Форма.Элементы.Добавить( "Кнопка" + ИмяКоманды, Тип("КнопкаФормы"), Группа); 
	КнопкаФормы.ИмяКоманды = ИмяКоманды; 
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	
КонецПроцедуры	

#КонецОбласти

#Область СистемаОповещенийПользователя


Функция ПроверитьОбъект( Источник ,ИмяОбъекта )
	Если ТипЗнч(Источник) = Тип("ДокументОбъект." + ИмяОбъекта) ИЛИ 
		ТипЗнч(Источник) = Тип("ДокументСсылка." + ИмяОбъекта) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

Процедура СоздатьСообщениеПоСобытию(Источник, Отказ, РежимПроведения) Экспорт
	
	Если НЕ ИспользоватьСообщенияПользователям() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьОбъект( Источник ,"ПоступлениеБезналичныхДенежныхСредств" ) Тогда
		мТекст = СформироватьНаименованиеНовости(СокрЛП(Сред(Строка(ТипЗнч(Источник)), 18)),
		                                         Источник.Номер,
												 Источник.Дата);
		
		
		//мТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 № %2 от %3",СокрЛП(Сред(Строка(ТипЗнч(Источник)), 18)),
		//																Источник.Номер,
		//																Формат(Источник.Дата,"ДФ=""дд.ММ.гг 'г.'"""));
		Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			НаименованиеОповещения = СформироватьНаименованиеНовости(Строка(ТипЗнч(Источник.ДокументОснование)),Источник.ДокументОснование.Номер, мТекст);
			ОповещениеПользователя =  РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьОповещение( НаименованиеОповещения , Источник.ДокументОснование.Автор); 
														
			ТекстНовости = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Поступление безналичных денежных средств по Заказу клиента № %1 от %2 %3 Контрагент : %4", 
								   Источник.ДокументОснование.Номер, Формат(Источник.ДокументОснование.Дата,"ДФ=""дд.ММ.гг 'г.'"""),
								   Символы.ПС, СокрЛП(Источник.ОснованиеПлатежа.Контрагент.Наименование));
								   
			СостояниеЗаказа = _ДоработкиСлужебный.ПолучитьСостояниеЗаказаКлиента(Источник.ДокументОснование);
			Если НЕ СостояниеЗаказа = Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
				СоздатьСообщениеПользователю(ОповещениеПользователя,НаименованиеОповещения, ТекстНовости, Источник.ДокументОснование.Автор, Источник.ДокументОснование);
			КонецЕсли; 
								   
		ИначеЕсли Источник.ДокументОснование = Неопределено Тогда
			
			Для Каждого ТекСтрока Из Источник.РасшифровкаПлатежа Цикл
				Если ТипЗнч(ТекСтрока.ОснованиеПлатежа) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
					НаименованиеОповещения = СформироватьНаименованиеНовости(Строка(ТипЗнч(ТекСтрока.ОснованиеПлатежа)),
		                                         ТекСтрока.ОснованиеПлатежа.Номер,мТекст);
					ОповещениеПользователя = РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьОповещение( НаименованиеОповещения ,ТекСтрока.ОснованиеПлатежа.Автор); 
					ТекстНовости = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Поступление безналичных денежных средств по Заказу клиента № %1 от %2 %3 Контрагент : %4", 
								   ТекСтрока.ОснованиеПлатежа.Номер, Формат(ТекСтрока.ОснованиеПлатежа.Дата,"ДФ=""дд.ММ.гг 'г.'"""),
								   Символы.ПС, СокрЛП(ТекСтрока.ОснованиеПлатежа.Контрагент.Наименование));
										   
					СостояниеЗаказа = _ДоработкиСлужебный.ПолучитьСостояниеЗаказаКлиента(ТекСтрока.ОснованиеПлатежа);
					Если НЕ СостояниеЗаказа = Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
						СоздатьСообщениеПользователю(ОповещениеПользователя,НаименованиеОповещения, ТекстНовости, ТекСтрока.ОснованиеПлатежа.Автор, ТекСтрока.ОснованиеПлатежа);
					КонецЕсли; 
				КонецЕсли;
			КонецЦикла;		// ТекСтрока Из Источник.РасшифровкаПлатежа
			
		КонецЕсли; 
		
	ИначеЕсли ПроверитьОбъект( Источник ,"ПриобретениеТоваровУслуг" ) Тогда
		
		Если ТипЗнч(Источник.ЗаказПоставщику.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента")  И НЕ Источник.ЗаказПоставщику.ДокументОснование = Документы.ЗаказКлиента.ПустаяСсылка() Тогда
			Заказ					= Источник.ЗаказПоставщику.ДокументОснование;
			ПостулениеТовара	 	= ПроверитьПоступление(Источник, Заказ); 
			
			НаименованиеОповещения = СформироватьНаименованиеНовости(Строка(ТипЗнч(Заказ)),Строка(ТипЗнч(Заказ)), ПостулениеТовара);
			ОповещениеПользователя = РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьОповещение( НаименованиеОповещения ,Заказ.Автор); 
														
														
														
			ТекстНовости = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Поступление товаров по Заказу клиента № %1 от %2 %3 %4 %5 Контрагент : %6", 
								   Заказ.Номер, Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'"""),
								   Символы.ПС,ПостулениеТовара,Символы.ПС, СокрЛП(Заказ.Контрагент.Наименование));						   
									   
									   
			СостояниеЗаказа = _ДоработкиСлужебный.ПолучитьСостояниеЗаказаКлиента(Заказ);
			Если НЕ СостояниеЗаказа = Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
				СоздатьСообщениеПользователю(ОповещениеПользователя,НаименованиеОповещения, ТекстНовости, Заказ.Автор, Заказ);
				СозданиеЗадач(Источник, Заказ);
			КонецЕсли; 
			
			//**ДОБАВЛЕНО Максимов В.А.
			
			//**Поступления по заказу начало
			
			ЗаказПоставщику 		= Источник.ЗаказПоставщику;
			ПоступлениеПоЗаказу 	= _ДоработкиСлужебный.ПроверитьПоступлениеПоЗаказуПоставщику(Источник, ЗаказПоставщику);
			
			НаименованиеОповещения = СформироватьНаименованиеНовости(Строка(ТипЗнч(ЗаказПоставщику)), ЗаказПоставщику.Номер,ПоступлениеПоЗаказу);
			ОповещениеПользователя = РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьОповещение( НаименованиеОповещения , ЗаказПоставщику.Автор); 
			
			ТекстНовости		 	= "Поступление товаров по Заказу поставщику № " + 
									   ЗаказПоставщику.Номер + " от " + 
									   Формат(ЗаказПоставщику.Дата,"ДФ=""дд.ММ.гг 'г.'""") +
									   Символы.ПС + ПостулениеТовара + Символы.ПС + 
									   "Контрагент : " + СокрЛП(ЗаказПоставщику.Контрагент.Наименование);
												   
			СоздатьСообщениеПользователю(ОповещениеПользователя,НаименованиеОповещения, ТекстНовости, ЗаказПоставщику.Автор, ЗаказПоставщику);
			СозданиеЗадачЗакупщика(Источник, ЗаказПоставщику);
			
			//**Поступления по заказу конец
			
		ИначеЕсли ТипЗнч(Источник.ЗаказПоставщику.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента")  И Источник.ЗаказПоставщику.ДокументОснование = Документы.ЗаказКлиента.ПустаяСсылка() Тогда
			ТзЗакупки = Источник.Товары.Выгрузить(,"Назначение");
			ТзЗакупки.Колонки.Добавить("Заказ");
			Для Каждого ТекСтрока Из ТзЗакупки Цикл
				ТекСтрока.Заказ = ТекСтрока.Назначение.Заказ;
			КонецЦикла;		// ТекСтрока Из ТзЗакупки
			ТзЗакупки.Свернуть("Заказ");
			Заказ					= Документы.ЗаказКлиента.ПустаяСсылка(); 
			Для Каждого ТекСтрока Из ТзЗакупки Цикл
				Если Заказ = ТекСтрока.Заказ Тогда
					Продолжить;
				КонецЕсли;
				Заказ				= ТекСтрока.Заказ;
				ПостулениеТовара	= ПроверитьПоступление(Источник, Заказ); 
				
				Если ПостулениеТовара = "" Тогда
					Продолжить;
				КонецЕсли;
				
				НаименованиеОповещения = СформироватьНаименованиеНовости(Строка(ТипЗнч(Заказ)),	Заказ.Номер,ПостулениеТовара);
				
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Автор", Заказ.Метаданные() ) Тогда
					ОповещениеПользователя = РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьОповещение( НаименованиеОповещения , Заказ.Автор);	
				ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", Заказ.Метаданные() ) Тогда	
					ОповещениеПользователя = РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьОповещение( НаименованиеОповещения , Заказ.Ответственный);
				Иначе	
					Продолжить;
				КонецЕсли;
				
				
				Если ( Заказ.ДокументОснование = Неопределено ) Тогда
					ТекстНовости	 	= "Поступление товаров по Заказу клиента № " + 
										   Заказ.Номер + " от " + 
										   Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""") +
										   Символы.ПС + ПостулениеТовара + Символы.ПС + 
										   "Контрагент : " + СокрЛП(Заказ.Контрагент.Наименование);
			    Иначе
					ТекстНовости	 	= "Поступление товаров по Заказу клиента № " + 
										   Заказ.Номер + " от " + 
										   Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""") +
										   Символы.ПС + ПостулениеТовара + Символы.ПС + 
										   "Контрагент : " + СокрЛП(Заказ.ДокументОснование.Контрагент.Наименование);										   
				КонецЕсли;										   
										   
										   
				СостояниеЗаказа = _ДоработкиСлужебный.ПолучитьСостояниеЗаказаКлиента(Заказ);
				Если НЕ СостояниеЗаказа = Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
					Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Автор", Заказ.Метаданные() ) Тогда
						СоздатьСообщениеПользователю(ОповещениеПользователя ,НаименованиеОповещения, ТекстНовости, Заказ.Автор, Заказ);
					ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", Заказ.Метаданные() ) Тогда
						СоздатьСообщениеПользователю(ОповещениеПользователя ,НаименованиеОповещения, ТекстНовости, Заказ.Ответственный, Заказ.ДокументОснование);						
					КонецЕсли;	
					СозданиеЗадач(Источник, Заказ);
				КонецЕсли; 
				
			КонецЦикла;		// ТекЗаказ Из ТзЗакупки
		КонецЕсли;
		
	ИначеЕсли ПроверитьОбъект( Источник ,"СборкаТоваров" ) Тогда
		
		
		Если Источник.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано Тогда
			
			Заказ				= Источник.ЗаказНаСборку.ДокументОснование;
			//мТекст				= СокрЛП(Сред(Строка(ТипЗнч(Источник)), 18)) + " № " + Источник.Номер + " от " + Формат(Источник.Дата,"ДФ=""дд.ММ.гг 'г.'""");
			
			
			мТекст = СформироватьНаименованиеНовости(СокрЛП(Сред(Строка(ТипЗнч(Источник)), 18)),
		                                         Источник.Номер,Источник.Дата);
			НаименованиеОповещения = СформироватьНаименованиеНовости(Строка(ТипЗнч(Заказ)),
		                                         	Заказ.Номер,мТекст);									 
												 
			ОповещениеПользователя =  РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьОповещение( НаименованиеОповещения , Заказ.Автор);
			ТекстНовости	 	= "Сборка товаров по Заказу клиента № " + 
								   Заказ.Номер + " от " + 
								   Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""") +
								   Символы.ПС + "Собрано " + СокрЛП(Источник.Номенклатура.Наименование) + " - " +Источник.КоличествоУпаковок + " " + СокрЛП(Источник.Номенклатура.ЕдиницаИзмерения.Наименование) +
								   Символы.ПС + "Контрагент : " + СокрЛП(Заказ.Контрагент.Наименование);
			СостояниеЗаказа = _ДоработкиСлужебный.ПолучитьСостояниеЗаказаКлиента(Заказ);
			Если НЕ СостояниеЗаказа = Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
				СоздатьСообщениеПользователю(ОповещениеПользователя,НаименованиеОповещения, ТекстНовости, Заказ.Автор, Заказ);
				СозданиеЗадач(Источник, Заказ);
			КонецЕсли; 
				
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользоватьСообщенияПользователям() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы._ВыводитьСообщенияПользователям.Получить();
КонецФункции 

Функция ПолучитьСписокСообщений(Автор) Экспорт
	
	Возврат РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьСписокСообщений( Автор );
	
КонецФункции // ПолучитьСписокНовостей()

Функция ПолучитьСообщениеПоИдентификатору( мИдентификаторНовости ) Экспорт
	Возврат РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьСообщениеПоИдентификатору( мИдентификаторНовости );
КонецФункции	
	

Функция ПолучитьСсылкуОповещения(ТекущееОповещение) Экспорт
	Возврат ТекущееОповещение.Ссылка;
КонецФункции // ПолучитьСсылкуОповещения(ТекущееОповещение)

Процедура СоздатьСообщениеПользователю(ОповещениеПользователя, НаименованиеОповещения , ТекстНовости, Автор, СсылкаДокумента, ДатаНачалаОповещения = Неопределено) Экспорт
	
	Если ( ОповещениеПользователя.ИдентификаторНовости = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")) Тогда
		
		ИдентификаторНовости = Новый УникальныйИдентификатор();
		
		
		НаборЗаписей = РегистрыСведений._СостоянияОповещенияПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(Автор);
		НаборЗаписей.Отбор.ИдентификаторНовости.Установить(ИдентификаторНовости);
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Пользователь         	= Автор;
		НоваяЗапись.ИдентификаторНовости	= ИдентификаторНовости;
		
		НоваяЗапись.Наименование			= НаименованиеОповещения;
		НоваяЗапись.ТекстНовости			= ТекстНовости;
		
		Если ( ДатаНачалаОповещения = Неопределено ) Тогда
			НоваяЗапись.ДатаНачалаОповещения 	= ТекущаяДата();
		Иначе
			НоваяЗапись.ДатаНачалаОповещения 	= ДатаНачалаОповещения;
		КонецЕсли;
		
		НоваяЗапись.Прочтена             	= Ложь;
		НоваяЗапись.Пометка              	= 0;
		НоваяЗапись.ОповещениеВключено   	= Истина;
		НоваяЗапись.УдаленаИзСпискаНовостей = Ложь;
		
		
		Если ЗначениеЗаполнено( СсылкаДокумента ) Тогда
			Если НЕ ( СсылкаДокумента.Пустая() ) Тогда
				ДопСтруктура = РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьСтруктуруДополнительныхЗначенийСообщения();
				ДопСтруктура.ИмяДокумента				= СсылкаДокумента.МетаДанные().Имя;
				ДопСтруктура.НомерДокумента				= СсылкаДокумента.Номер;
				ДопСтруктура.ДатаДокумента				= СсылкаДокумента.Дата;
		        ДопСтруктура.УникальныйИдентификатор 	= XMLСтрока( СсылкаДокумента.УникальныйИдентификатор() );
				
				НоваяЗапись.ДополнительныеЗначения = ОбщегоНазначения.ЗначениеВСтрокуXML( ДопСтруктура );
			КонецЕсли;	
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры	// СоздатьСообщениеПользователю()

Процедура ЗаписатьИзменениеСостоянияНовостиСервер(ИдентификаторНовости, лкПрочтена, лкПометка, лкОповещениеВключено, лкДатаНачалаОповещения = '00010101', лкТекущийПользователь) Экспорт
	РегистрыСведений._СостоянияОповещенияПользователей.ЗаписатьИзменениеСостоянияНовостиСервер(ИдентификаторНовости,
								лкПрочтена,лкПометка, лкОповещениеВключено,
								лкДатаНачалаОповещения, лкТекущийПользователь);
КонецПроцедуры

Функция СформироватьНаименованиеНовости(Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
										Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
										Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	Результат = "";
	
	Результат = Параметр1 + ?(Параметр2 = Неопределено,"",",") + Параметр2 +
							?(Параметр3 = Неопределено,"",",") + Параметр3 +
							?(Параметр4 = Неопределено,"",",") + Параметр4 +
							?(Параметр5 = Неопределено,"",",") + Параметр5 +
							?(Параметр6 = Неопределено,"",",") + Параметр6 +
							?(Параметр7 = Неопределено,"",",") + Параметр7 +
							?(Параметр8 = Неопределено,"",",") + Параметр8 +
							?(Параметр9 = Неопределено,"",",") + Параметр9;
	Возврат Результат;									
										
КонецФункции	

Функция ПолучитьРасшифровкуДополнительныхЗначенийСообщения( ДополнительныеЗначения ) Экспорт
	Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML( ДополнительныеЗначения );
КонецФункции	




#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Функция ПроверитьПоступление(Источник, Заказ) Экспорт
	
	Если Заказ = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мТекст = СокрЛП(Сред(Строка(ТипЗнч(Источник)), 18)) + " № " + Источник.Номер + " от " + Формат(Источник.Дата,"ДФ=""дд.ММ.гг 'г.'""");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |	ПриобретениеТоваровУслугТовары.Назначение КАК Назначение,
	               |	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	               |	ПриобретениеТоваровУслугТовары.Серия КАК Серия,
	               |	ПриобретениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ПриобретениеТоваровУслугТовары.Количество КАК Количество
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО ПриобретениеТоваровУслугТовары.Назначение = Назначения.Ссылка
	               |ГДЕ
	               |	Назначения.Заказ = &Заказ";
	
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	ТЗТваровПоЗаказу = Запрос.Выполнить().Выгрузить();
	ТЗТваровПоЗаказу.Свернуть("Номенклатура, Характеристика, Серия", "КоличествоУпаковок, Количество");
	
	ТзЗаказы		 = Заказ.Товары.Выгрузить();
	ТзЗаказы.Свернуть("Номенклатура, Характеристика, Серия", "КоличествоУпаковок, Количество");
	
	Если ТЗТваровПоЗаказу.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из ТзЗаказы Цикл
			ПараметрыПоиска   = Новый Структура("Номенклатура, Характеристика, Серия", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия);
			Строки 			  = ТЗТваровПоЗаказу.НайтиСтроки(ПараметрыПоиска);
			
			Если Строки.Количество() > 0 Тогда
				Для Каждого СтрокаЗаказа Из Строки Цикл
					ТекСтрока.КоличествоУпаковок = ТекСтрока.КоличествоУпаковок - СтрокаЗаказа.КоличествоУпаковок ;
					ТекСтрока.Количество		 = ТекСтрока.Количество			- СтрокаЗаказа.Количество ;
				КонецЦикла;		// СтрокаЗаказа Из Строки
			КонецЕсли; 
		КонецЦикла;		// ТекСтрока Из ТЗТваровПоЗаказу 
		
		Если ТзЗаказы.Итог("КоличествоУпаковок") = 0 Тогда
			мТекст = "Весь товар по заказу: Поступил";
		КонецЕсли;	
	КонецЕсли;
	
	Возврат мТекст;	
	
КонецФункции // ПостулениеТовара()

Функция НайтиПросроченныеЗаказы()  Экспорт
	
	НачалоСледующегоДня = НачалоДня(ТекущаяДата() + 86400);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК Заказ,
	               	|	СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток) КАК ЗаказаноОстаток
	               	|ПОМЕСТИТЬ ВТ_Заказы
	               	|ИЗ
	               	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НачалоСледующегоДня, ) КАК ЗаказыПоставщикамОстатки
	               	|
	               	|СГРУППИРОВАТЬ ПО
	               	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
	               	|	ВТ_Заказы.Заказ КАК Заказ,
	               	|	ВТ_Заказы.Заказ.ДатаПоступления КАК ДатаПоступления,
	               	|	ВТ_Заказы.ЗаказаноОстаток КАК ЗаказаноОстаток,
	               	|	СостоянияЗаказовПоставщикам.Состояние КАК Состояние
	               	|ИЗ
	               	|	ВТ_Заказы КАК ВТ_Заказы
	               	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовПоставщикам КАК СостоянияЗаказовПоставщикам
	               	|		ПО (СостоянияЗаказовПоставщикам.Заказ = ВТ_Заказы.Заказ)
	               	|ГДЕ
	               	|	ВТ_Заказы.Заказ.ДатаПоступления <= &НачалоСледующегоДня
	               	|	И ВТ_Заказы.ЗаказаноОстаток > 0
	               	|	И СостоянияЗаказовПоставщикам.Состояние <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)";
	
	
	
	
	Запрос.УстановитьПараметр("НачалоСледующегоДня", НачалоСледующегоДня);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	

Функция ПроверитьЕстьЛиПоступлениеПоЗаказуПоставщику(Заказ)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И ПриобретениеТоваровУслуг.ЗаказПоставщику = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции	

#КонецОбласти



#Область ЗадачиПользователю

Процедура СозданиеЗадач(Источник, Заказ)
	
		Если ПроверитьПоступление(Источник, Заказ) = "Весь товар по заказу: Поступил" Тогда
			ПараметрыЗадачи = ПолучитьПараметрыЗадачи();
			ПараметрыЗадачи.Исполнитель		= Заказ.Автор;
			ПараметрыЗадачи.ДатаИсполнения	= ТекущаяДата();
			ПараметрыЗадачи.Предмет			= Заказ.Ссылка;
			ПараметрыЗадачи.Наименование	= "Отгрузка по Заказу клиента № " + 
											   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""");
			ПараметрыЗадачи.Описание		= "По Заказу клиента № " + 
											   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""") + 
											   "  - поступил весь товар. Необходимо провести отгрузку товара клиенту";
			ПараметрыЗадачи.ПредметСтрокой	= Строка(Заказ);
			ПараметрыЗадачи.Автор			= Константы._АвторСистемныхЗдач.Получить();
			ПараметрыЗадачи.АвторСтрокой	= Строка(Константы._АвторСистемныхЗдач.Получить());
			СоздатьЗадачуИсполнителю(ПараметрыЗадачи);
		КонецЕсли;
	
КонецПроцедуры	// СозданиеЗадач()

//**ДОБАВЛЕНО Максимов В.А.

Процедура СозданиеЗадачЗакупщика(Источник, Заказ)
	
	Если _ДоработкиСлужебный.ПроверитьПоступлениеПоЗаказуПоставщику(Источник, Заказ) = "Весь товар по заказу: Поступил" Тогда
		ПараметрыЗадачи = ПолучитьПараметрыЗадачи();
		ПараметрыЗадачи.Исполнитель		= Заказ.Автор;
		ПараметрыЗадачи.ДатаИсполнения	= ТекущаяДата();
		ПараметрыЗадачи.Предмет			= Заказ.Ссылка;
		ПараметрыЗадачи.Наименование	= "Приход по Заказу поставщику № " + 
										   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""");
		ПараметрыЗадачи.Описание		= "По Заказу поставщику № " + 
										   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""") + 
										   "  - поступил весь товар.";
		ПараметрыЗадачи.ПредметСтрокой	= Строка(Заказ);
		ПараметрыЗадачи.Автор			= Константы._АвторСистемныхЗдач.Получить();
		ПараметрыЗадачи.АвторСтрокой	= Строка(Константы._АвторСистемныхЗдач.Получить());
		СоздатьЗадачуИсполнителю(ПараметрыЗадачи);
	КонецЕсли;
	
КонецПроцедуры

Процедура СозданиеЗадачЗакупщикаЗаказПросрочен(Заказ) Экспорт
	
	ПараметрыЗадачи = ПолучитьПараметрыЗадачи();
	ПараметрыЗадачи.Исполнитель		= Заказ.Автор;
	ПараметрыЗадачи.ДатаИсполнения	= ТекущаяДата();
	ПараметрыЗадачи.Предмет			= Заказ;
	ПараметрыЗадачи.Наименование	= "Просрочен приход по Заказу поставщику № " + 
									   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""");
	ПараметрыЗадачи.Описание		= "По Заказу поставщику № " + 
									   Заказ.Номер + " от " + Формат(Заказ.Дата,"ДФ=""дд.ММ.гг 'г.'""") + 
									   "  - товар не поступил.";
	ПараметрыЗадачи.ПредметСтрокой	= Строка(Заказ);
	ПараметрыЗадачи.Автор			= Константы._АвторСистемныхЗдач.Получить();
	ПараметрыЗадачи.АвторСтрокой	= Строка(Константы._АвторСистемныхЗдач.Получить());
	СоздатьЗадачуИсполнителю(ПараметрыЗадачи);
	
КонецПроцедуры


//*************************

Процедура СоздатьЗадачуИсполнителю(ПараметрыЗадачи) Экспорт
	
	//Если СозданаЗадачаИсполнителю(ПараметрыЗадачи) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//БизнесПроцессОбъект					= БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
	//
	//БизнесПроцессОбъект.Дата		 	= ТекущаяДата();
	//БизнесПроцессОбъект.СрокИсполнения	= ДобавитьДнейКДате(ТекущаяДата(), Константы._КоличествоДнейНаИсполненинЗадачи.Получить());
	//
	//БизнесПроцессОбъект.Автор			= ПараметрыЗадачи.Автор;
	//БизнесПроцессОбъект.АвторСтрокой	= ПараметрыЗадачи.АвторСтрокой;
	//БизнесПроцессОбъект.Исполнитель		= ПараметрыЗадачи.Исполнитель;
	//
	//БизнесПроцессОбъект.Наименование	= ПараметрыЗадачи.Наименование;
	//БизнесПроцессОбъект.Предмет			= ПараметрыЗадачи.Предмет;
	//БизнесПроцессОбъект.Содержание		= ПараметрыЗадачи.Описание;
	//
	//БизнесПроцессОбъект.Выполнено	 	= Ложь;
	//БизнесПроцессОбъект.Завершен	 	= Ложь;
	//БизнесПроцессОбъект.Стартован	 	= Ложь;
	//БизнесПроцессОбъект.Состояние	 	= Перечисления.СостоянияБизнесПроцессов.Активен;
	//БизнесПроцессОбъект.Важность	 	= Перечисления.ВариантыВажностиЗадачи.Обычная;
	//БизнесПроцессОбъект.Записать();
	//
	//БизнесПроцессОбъект.Старт();
    
КонецПроцедуры	// СоздатьЗадачуИсполнителю()

Функция ПолучитьПараметрыЗадачи()
	Возврат Новый Структура("Исполнитель, Автор, АвторСтрокой, ДатаИсполнения, Описание, Наименование, Предмет, ПредметСтрокой");
КонецФункции // ПолучитьПараметрыЗадачи()

Функция ДобавитьДнейКДате(ТекДата, КолДней) Экспорт
	
	ОдинДень   = 60 * 60 * 24;
	ДатаНаДень = ТекДата + (ОдинДень * КолДней);
	
	СдвигДаты  = 0;
	Если ДеньНедели(ДатаНаДень) = 6 Тогда
		СдвигДаты  = 2;
	ИначеЕсли ДеньНедели(ДатаНаДень) = 7 Тогда
		СдвигДаты  = 1;
	ИначеЕсли ДеньНедели(ДатаНаДень) = 1 Тогда
		СдвигДаты  = 2;
	КонецЕсли;
	
	Возврат ТекДата + (ОдинДень * (КолДней + СдвигДаты));
	
КонецФункции

Функция СозданаЗадачаИсполнителю(ПараметрыЗадачи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеБизнесПроцессов.БизнесПроцесс КАК БизнесПроцесс,
	               |	ДанныеБизнесПроцессов.Номер КАК Номер,
	               |	ДанныеБизнесПроцессов.Дата КАК Дата,
	               |	ДанныеБизнесПроцессов.Завершен КАК Завершен,
	               |	ДанныеБизнесПроцессов.Стартован КАК Стартован,
	               |	ДанныеБизнесПроцессов.Автор КАК Автор,
	               |	ДанныеБизнесПроцессов.ДатаЗавершения КАК ДатаЗавершения,
	               |	ДанныеБизнесПроцессов.Наименование КАК Наименование,
	               |	ДанныеБизнесПроцессов.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	РегистрСведений.ДанныеБизнесПроцессов КАК ДанныеБизнесПроцессов
	               |ГДЕ
	               |	ДанныеБизнесПроцессов.Наименование = &Наименование
	               |	И ДанныеБизнесПроцессов.БизнесПроцесс.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Наименование", ПараметрыЗадачи.Наименование);
	Запрос.УстановитьПараметр("Исполнитель",  ПараметрыЗадачи.Исполнитель);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПолучитьЗадачу()

//++ Сухарев Б.В. 24.06.2019

Функция ПолучитьИнформациюПоРасходномуОрдеру(Распоряжение, Назначение, Номенклатура, Характеристика, ВсеТовары = Ложь, ПоРабСтолу = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Если ВсеТовары Тогда
		Запрос.Текст ="ВЫБРАТЬ
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку КАК ЗаявкаНаДоставку,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Склад КАК Склад,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение КАК Назначение,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._СпособДоставки КАК СпособДоставки
		              |ИЗ
		              |	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		              |ГДЕ
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
					  |";
	Иначе
		Запрос.Текст ="ВЫБРАТЬ
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку КАК ЗаявкаНаДоставку,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Склад КАК Склад,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение КАК Назначение,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._СпособДоставки КАК СпособДоставки
		              |ИЗ
		              |	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		              |ГДЕ
		              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
		              |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение = &Назначение
		              |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура = &Номенклатура
		              |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика = &Характеристика";
		
		Запрос.УстановитьПараметр("Назначение",     Назначение);
		Запрос.УстановитьПараметр("Номенклатура",   Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Распоряжение",   Распоряжение);
	
	Результат = Запрос.Выполнить();
	Если  НЕ Результат.Пустой() Тогда
		Если ПоРабСтолу Тогда
			Выборка	  = Результат.Выгрузить()[0];
		Иначе
			Выборка	  = Результат.Выгрузить();
		КонецЕсли;
		
		Возврат Выборка
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ПолучитьТипТранспортногоСредства()

Функция ЗаполнитьТоварыКДоставке(ТекОбъект) Экспорт
	
	ТоварыКДоставке = Новый ТаблицаЗначений;
	
	НаборЗаписей = РегистрыСведений.ТоварыКДоставке.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаданиеНаПеревозку.Установить(ТекОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	ТоварыКДоставке = НаборЗаписей.Выгрузить();
	
	Возврат ТоварыКДоставке;
	
КонецФункции	

#КонецОбласти




#Область ДоступКЭлементамПоРолям

Процедура НастроитьФормуЗаказаПоставщикуДляМенеджераПоЗакупкам( Форма ) Экспорт
	
	Если НЕ ПользовательВГруппеДосупа( Пользователи.ТекущийПользователь() , Справочники.ПрофилиГруппДоступа.МенеджерПоЗакупкам ) Тогда
		Возврат;
	КонецЕсли;	
	
	Форма.Элементы.СтраницаДоставка.Видимость = Ложь;
	
	
	
КонецПроцедуры	

Функция ПользовательВГруппеДосупа( Пользователь , Профиль ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка,
	|	ГруппыДоступа.Профиль КАК Профиль
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|	ГруппыДоступа.Пользователи.Пользователь = &Пользователь
	|	И ГруппыДоступа.Профиль = &Профиль";
	
	
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь );
	Запрос.УстановитьПараметр("Профиль", Профиль );
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции	

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Процедура МинимальныйИнтерфейс() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|	ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	ГруппыДоступа = Запрос.Выполнить().Выгрузить();
	
	//Для Каждого Группа Из ГруппыДоступа Цикл		
	//	Если Группа.Ссылка.Наименование = "Менеджер по продажам" ИЛИ Группа.Ссылка.Наименование = "Менеджер по закупкам" Тогда
	//	   	НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;	
	//		
	//		НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();
	//		
	//	  	НастройкиСостава.Верх.Очистить();
	//	    НастройкиСостава.Лево.Очистить();
	//	    НастройкиСостава.Низ.Очистить();
	//	    НастройкиСостава.Право.Очистить();
	//		
	//		НастройкиСостава.Верх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
	//		
	//	    НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
	//	    ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", НастройкиИнтерфейса);
	//	КонецЕсли;
	//КонецЦикла;	
	
	//КлючОбъекта = "Общее/НастройкиНачальнойСтраницы";
	//ТекущиеНастройки = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта);
	//
	//Если ТипЗнч(ТекущиеНастройки) = Тип("НастройкиНачальнойСтраницы") Тогда
	//	ТекущийСоставФорм = ТекущиеНастройки.ПолучитьСоставФорм();
	//	Если ТекущийСоставФорм.ПраваяКолонка.Количество() = 0
	//	   И ТекущийСоставФорм.ЛеваяКолонка.Количество() = 1
	//	   И ТекущийСоставФорм.ЛеваяКолонка[0] = "ОбщаяФорма.ПустойРабочийСтол" Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//СоставФорм = Новый СоставФормНачальнойСтраницы;
	//СоставФорм.ЛеваяКолонка.Добавить("ОбщаяФорма.ПустойРабочийСтол");
	//Настройки = Новый НастройкиНачальнойСтраницы;
	//Настройки.УстановитьСоставФорм(СоставФорм);
	//ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта, "", Настройки);

	
КонецПроцедуры

#КонецОбласти
